app/controllers/posts_controller.rb

  def show
    @post = Post.find_by(id: params[:id])
    @user = @post.user
    @likes_count = Like.where(post_id: @post.id).count
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]

  def create
    @post = Post.new(
      content: params[:content],
      user_id: @current_user.id
    )
    if @post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "今日のテーマについて意見ある人他にいますか？"], ["user_id", 1], ["created_at", "2020-05-09 15:15:35.771342"], ["updated_at", "2020-05-09 15:15:35.771342"]]