app/controllers/users_controller.rb

  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name: "default_user.jpg",
      password: params[:password]
    )
    if @user.save
---
INSERT INTO "users" ("name", "email", "image_name", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)

def update
  @user = User.find_by(id: params[:id])
  @user.name = params[:name]
  @user.email = params[:email]

  if params[:image]
    @user.image_name = "#{@user.id}.jpg"
    image = params[:image]
    File.binwrite("public/user_images/#{@user.image_name}", image.read)
  end

  if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "竈門炭治郎"], ["image_name", "1.jpg"], ["updated_at", "2020-05-09 16:43:39.887151"], ["id", 1]]